## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.helm.helm_release.sample_app will be created
  + resource "helm_release" "sample_app" {
      + atomic                     = false
      + chart                      = "sample-app"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "sample-app"
      + namespace                  = "sample-app"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://konopkap.github.io/2bc"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                ingress:
                  enabled: true
                  hosts:
                    - host: sample-app.patryk2bc.example.com
                      paths:
                        - path: /
                          pathType: ImplementationSpecific
                
                resources:
                  limits:
                    memory: 256Mi
                  requests:
                    cpu: 20m
                    memory: 64Mi
                
                autoscaling:
                  enabled: true
                  maxReplicas: 3
            EOT,
        ]
      + verify                     = false
      + version                    = "0.2.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>